part_03/04_propeller/MRF/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type          forces;
    libs          ("libforces.so");
    log           yes;

    patches       ("propeller.*");
    rho           rhoInf;     // Indicates incompressible
    rhoInf        1000;       // Redundant for incompressible
    pRef          0;

    CofR          (0.0 0.0 0.0); // Rotation around centre line of propeller
}


// ************************************************************************* //
