part_03/04_propeller/MRF/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;

snap            on;

addLayers       off;

geometry
{
    external
    {
        type triSurfaceMesh;
        file "external.obj";
        regions
        {
            inlet { name inlet; }
            outlet { name outlet; }
        }
    }

    rotatingZone
    {
        type triSurfaceMesh;
        file "rotatingZone.obj";
    }

    propeller
    {
        type triSurfaceMesh;
        file "propeller.obj";
    }

    shaft
    {
        type triSurfaceMesh;
        file "shaft.obj";
    }
}

castellatedMeshControls
{
    features
    (
    );

    refinementSurfaces
    {
        external
        {
            level (1 1);
            patchInfo
            {
                type wall;
                inGroups (externalWall);
            }

            regions
            {
                inlet
                {
                    level (1 1);
                    patchInfo { type patch; }
                }
                outlet
                {
                    level (1 1);
                    patchInfo { type patch; }
                }
            }
        }

        rotatingZone
        {
            level (1 1);
            faceZone rotatingZone;
            cellZone rotatingZone;
            mode inside;
        }

        propeller
        {
            level (2 2);
            patchInfo { type wall; }
        }

        shaft
        {
            level (1 1);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        external
        {
            mode    inside;
            level   1;
        }
    }

    insidePoint (0 0 0.5);
    nCellsBetweenLevels 3;
}

snapControls
{
    explicitFeatureSnap    off;
    implicitFeatureSnap    on;
}

addLayersControls
{
    layers
    {
        "external.*" { nSurfaceLayers 0; }
        "propeller.*" { nSurfaceLayers 0; }
        "shaft.*" { nSurfaceLayers 0; }
    }

    relativeSizes       on; // off, usually with firstLayerThickness
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        0.001;
    firstLayerThickness-disabled 0;
    maxThicknessToMedialRatio-disabled 0.3;
}

// delete "-disabled" to output mesh data, e.g. for layers
writeFlags-disabled
(
    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
